
//問題と解答

qa = new Array();
qa[0] = ["対ドイツ強硬論を主張したイギリス人","ロイドジョージ","クレマンリー","ヌイ",1];
qa[1] = ["国際連盟常任理事国でない国はどこか","中国","イタリア","フランス",1];
qa[2] = ["ドイツが敗戦後にフランスに割譲した地方はどこ","ロレーヌ地方","ジュネーブ","ラインラント",1];
qa[3] = ["四カ国条約の年号は","１９２１","１９２２","１９２３",1];
qa[4] = ["ワシントン海軍軍備制限条約で制限されたのは","主力艦","補助館","鉄砲",1];
qa[5] = ["アジア太平洋における国際秩序はなんというか","ベルサイユ体制","ワシントン体制","ニューヨーク体制",2];
qa[6] = ["イギリスの第４回選挙法改正はいつか","１９１７","１９１８","１９１９",2];
qa[7] = ["イギリスで１９２４年に成立した労働党内閣は","ケンタッキー","マクドナルド","エーベルト",2];
qa[8] = ["ヴァイマール憲法成立時のドイツ内閣は","マクドナルド","エーベルト","ヤング",2];
qa[9] = ["エーベルトは何党でしょう","国民党","社会民主党","社会党",2];
qa[10] = ["ドイツの極度のインフレ時に発行された紙幣は","ドル紙幣","レニテンマルク","ポンド",2];
qa[11] = ["１９２８締結された国際紛争解決の協定は","ロンドン海軍軍縮条約","ケロッグブリアン協定","ジュネーブ条約",2];
qa[11] = ["ムッソリーニが結成した党","ローマ党","ローマ進軍ファシスト党","労働農民党",2];
qa[12] = ["ムッソリーニが１９２６年に保護国化した国はどこ","フィルメ","ユーゴ","アルバニア",3];
qa[13] = ["チェコスロバキアの大統領（１９１８）","ホルティ","ムッソリーニ","マサリク",3];
qa[14] = ["スターリンが追放した人物","レーニン","自分","トロッキー",3];
qa[15] = ["集団農場とは","ソフホーズ","レーニン","コルホーズ",3];
qa[16] = ["１９２０年にウィルソン民主党政権により実現したもの（イギリス）","男性参政権","関税自由化","女性参政権",3];
qa[17] = ["白人中産階級をローマ字で","BASP","VASP","WASP",3];
qa[18] = ["ラジオ放送の開始年（アメリカ）","１９１９","１９２２","１９２０",3];
qa[19] = ["第二次世界大戦の参加国は","４０カ国","４５カ国","５０カ国以上",1];
qa[20] = ["第二次世界大戦の犠牲者の七割は","一般市民","兵隊","看護師",1];
qa[21] = ["国家社会主義ドイツ労働者党のことをなんというか","ナチス","ファシズム","民主党",1];
qa[22] = ["世界恐慌が起きた場所","ウォール街","ニューヨーク","東京",1];
qa[23] = ["国会議事堂放火事件によりヒトラーに関してどんな法律が制定されたか","全権委任法","全力委任法","全会委任法",1];
qa[24] = ["１９３５年にドイツで出された法律は何","ニュルンベルク法","全権委任法","国家国民法",1];
qa[25] = ["ドイツ最大の軍事企業","クルップ社","グロック社","軍事社",1];
qa[26] = ["１９３８年にドイツが開いた会議（ズデーテン地方獲得）","ミュンヘン会議","日独防共会議","ワシントン会議",1];
qa[27] = ["独ソ不可侵条約の年号","１９２８","１９３９","１９４０",2];
qa[28] = ["ヒトラーを痛烈に風刺した「独裁者」を書いた人物","ゲットー","チャップリン","トマスモア",2];
qa[29] = ["ドイツが第二次世界大戦開戦時に襲撃した国","ソ連","ポーランド","アメリカ",2];
qa[30] = ["第二次世界大戦の際のソ連の共産党書記長は誰","ヒトラー","スターリン","アウシュビッツ",2];
qa[31] = ["１８４４年に採られた「史上最大の作戦」と呼ばれる作戦は","アウシュビッツ作戦","ノルマンディ上陸作戦","日本海海戦",2];
qa[32] = ["ギリシアトルコ戦争の年","１９１８","１９１９","１９２０",2];
qa[33] = ["トルコ大国民会議を開催した人物","アンカラ","ケマルパシャ","イズミル",2];
qa[34] = ["エジプトでは第一次世界大戦後に反英運動が起こったがその中心になった党はどこか","フマル党","ワフド党","セーブル党",2];
qa[35] = ["１９１６年にイスラム諸国が対フランスロシアに関する協定を結んだがその名前は何か","サイクスピコ","フセインマクマホン","バルフォア",1];
qa[36] = ["第三次アフガン戦争の結果、イギリスの保護国であった国が独立したがそれはどこか","パレスチナ","アフガニスタン","ドイツ",2];
qa[37] = ["イブンサウードが半島統一を目指した結果建設された国は","パフレウィー朝","サウジアラビア","レザノフ",2];
qa[38] = ["東南アジアでスカルノが結成した党は","困民党","インドネシア国民党","ローラット法",2];
qa[39] = ["１９３０年にベトナム共産党を結成した人物は","ガンディ","ホーチミン","スーチー",2];
qa[40] = ["中国で第一次世界大戦中におきた文化運動は","文化大革命","文学革命","二十一箇条の要求",2];
qa[41] = ["蒋介石が率いた軍は","国民覚醒軍","国民共産軍","国民革命軍",3];
qa[42] = ["１９２８年に奉天で日本軍に殺された人物","張学良","蒋介石","張作霖",3];
qa[42] = ["アメリカがドイツに対して賠償の支払いで一年の猶予を与えたのはなんというか","ニューディール","ブロック経済","フーヴァーモラトリアム",3];
qa[43] = ["生産制限と農産物価格の引き上げを目指す法律は何（アメリカ）","全国産業復興法","ワグナー法","農業調整法",3];
qa[44] = ["アメリカの労働者の団結権団体交渉権を保障する法律","農業調整法","キューバ法","ワグナー法",3];
qa[45] = ["ソ連が反ファシズム人民戦線を結成することになった会議","ルーブル会議","ワシントン会議","コミンテルン第７回大会",3];
qa[46] = ["ユダヤ人排斥を主張した１９３２年ドイツ第一党はどこ","ヒトラー党","ファシズム党","ナチ党",3];
qa[47] = ["ドイツが１９３５年にイギリスと結んだ、海軍を補強するという条約は","英独海軍協定","英独主力艦協定","海軍協定",1];
qa[48] = ["ドイツが１９３６年にロカルノ条約を破棄し進駐した地域は","ラインラント","ルーブル地方","アルザス地方",1];
qa[49] = ["清国最後の皇帝は誰","溥儀","袁世凱","伊藤博文",1];
qa[50] = ["日本が国際連盟脱退をした年","１９３３","１９３２","１９３５",1];
qa[51] = ["中国で抗日民族統一戦線を呼びかける宣言はなんと言われたか","八一宣言","五四宣言","三一宣言",1];
qa[52] = ["西安事件はいつ","１９３７","１９３８","１９３９",1];
qa[53] = ["南京政府の人物","汪兆銘","蒋介石","袁世凱",1];
qa[54] = ["国際連合の本部はどこにある","ニューヨーク","ジュネーブ","オードリー",1];
qa[55] = ["１９４５年に成立したイギリスの内閣は誰","アトリー","チャーチル","ローズベルト",1];
qa[56] = ["ベトナム民主共和党成立時の大統領は","スーチー","ホーチミン","アトリー",2];
qa[57] = ["インド独立の際の大統領","スーチー","ネルソン","ホーチミン",2];
qa[58] = ["中華人民共和国の首席は","周恩来","毛沢東","蒋介石",2];
qa[59] = ["第二次戦後に台湾に逃れた国は","中華人民共和国","中華民国","台湾民主国",2];
qa[60] = ["国際連合憲章草案を作成した会議","ブレトンウッズ会議","ダンバートンオークス会議","IBRD会議",2];
qa[61] = ["中中国での第二次五カ年計画はなんと呼ばれるか","平和運動","大躍進運動","民主国運動",2];
qa[62] = ["１９７２年に中国を訪問した米国大統領は誰か","ワシントン","ニクソン","レーガン",2];
qa[63] = ["１９７８年に日本と中国が結んだ条約はなんという","日中基本条約","日中平和友好条約","日中共同宣言",2];
qa[64] = ["香港返還の年はいつか","１９８８","１９９７","１９９６",2];
qa[65] = ["１９４３年にソ連がドイツに勝利した戦いをなんというか","ノルマンディーの戦い","ヘタリアの戦い","スターリングラードの戦い",3];
qa[66] = ["米軍が沖縄本島に上陸したのはいつか","１９４４","１９４３","１９４５",3];
qa[67] = ["１９４１にドイツが制圧した場所はどこ","日本","ソ連","ユーゴスラヴィア",3];
qa[68] = ["大西洋憲章を発表した際のイギリスの大統領は","ローズヴェルト","フランクリン","チャーチル",3];




//初期設定
q_sel = 3; //選択肢の数
q_max = 10; //出題数
qas = []; // 出題されたQA

setReady();

//初期設定
function setReady() {
	count = 0; //問題番号
	ansers = new Array(); //解答記録

	//最初の問題
	quiz();
}

//問題表示
function quiz() {
	var s, n;
	//問題
	rnd = Math.floor(Math.random() * qa.length);
	 //乱数
	document.getElementById("text_q").innerHTML = (count + 1) + "問目：" + qa[rnd][0];


	//選択肢
	s = "";
	for (n=1;n<=q_sel;n++) {
		if (qa[rnd][n] != "") {
			s += "<a href='javascript:anser(" + n + ")'><div class='btn-square-so-pop'>" + n + "：" + qa[rnd][n] + "</div></a>";
		}
	}
	document.getElementById("text_s").innerHTML = s;
}



//解答表示
function anser(num) {
	var s;
	s = (count + 1) + "問目：";
	//答え合わせ
  var q=qa[rnd];
  var ans=q[q_sel+1];
  var isCorrect=num==ans;
	ansers[count]=isCorrect?"〇":"✕";
	qas[count] = q;
	s+=ansers[count]+q[num];
  if(!isCorrect)s+="\n正解:"+q[ans];
  document.getElementById("text_a").innerText=s;
	//次の問題を表示
	count++;
	if (count < q_max) {
		quiz();
	} else {
		//終了
		s = "<div class='kekka'><table border='2'><caption>成績発表</caption></div>";
		//1行目
		s += "<tr><th>問題文</th><th>正しい答え</th><th>成否</th></tr>";

		//2行目以降
		for (let n=0; n < 10; n++) {
			s += "<tr>"
			// 問題文
			s += "<td>" + qas[n][0] + "</td>";
			// 正しい答え
			s += "<td>" + qas[n][qas[n][q_sel+1]] + "</td>";
			// 成否
			s += "<td>" + ansers[n] + "</td>";
			s += "</tr>";
		}
		s += "</table>";
		document.getElementById("text_q").innerHTML = s;
		//次の選択肢
		s = "<a href='javascript:setReady()'><div class='btn-square-so-pop'>もう一度やる！</div></a>";


		document.getElementById("text_s").innerHTML = s;
	}
}
